; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph5 - mode
	spectrograph2 - mode
	spectrograph1 - mode
	spectrograph0 - mode
	thermograph3 - mode
	infrared6 - mode
	thermograph4 - mode
	Star0 - direction
	Star4 - direction
	GroundStation6 - direction
	Star8 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Star2 - direction
	GroundStation7 - direction
	Star5 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 thermograph5)
	(supports instrument0 spectrograph2)
	(supports instrument0 thermograph4)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 Star2)
	(supports instrument1 spectrograph1)
	(supports instrument1 thermograph3)
	(supports instrument1 infrared6)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
)
(:goal (and
	(have_image Phenomenon9 thermograph5)
	(have_image Planet10 thermograph4)
	(have_image Star11 spectrograph1)
	(have_image Star11 thermograph3)
	(have_image Star12 spectrograph1)
	(have_image Phenomenon13 spectrograph1)
))

)

; plan
1. (turn_to satellite0 groundstation1 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
3. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 6
4. (turn_to satellite0 planet10 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet10)
   goals met: 0 of 6
5. (take_image satellite0 planet10 instrument0 thermograph4)
   added: (have_image planet10 thermograph4)
   goals met: 1 of 6
6. (turn_to satellite0 phenomenon9 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon9)
   goals met: 1 of 6
7. (take_image satellite0 phenomenon9 instrument0 thermograph5)
   added: (have_image phenomenon9 thermograph5)
   goals met: 2 of 6
8. (turn_to satellite0 groundstation7 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation7)
   goals met: 2 of 6
9. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 2 of 6
10. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 6
11. (calibrate satellite0 instrument1 groundstation7)
   added: (calibrated instrument1)
   goals met: 2 of 6
12. (turn_to satellite0 phenomenon13 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 phenomenon13)
   goals met: 2 of 6
13. (take_image satellite0 phenomenon13 instrument1 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 3 of 6
14. (turn_to satellite0 star11 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star11)
   goals met: 3 of 6
15. (take_image satellite0 star11 instrument1 spectrograph1)
   added: (have_image star11 spectrograph1)
   goals met: 4 of 6
16. (take_image satellite0 star11 instrument1 thermograph3)
   added: (have_image star11 thermograph3)
   goals met: 5 of 6
17. (turn_to satellite0 star12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star12)
   goals met: 5 of 6
18. (take_image satellite0 star12 instrument1 spectrograph1)
   added: (have_image star12 spectrograph1)
   goals met: 6 of 6
